{"module": "keras.src.models.functional", "class_name": "Functional", "config": {"name": "RoPE_Conformer", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 384, 708], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_features"}, "registered_name": null, "name": "input_features", "inbound_nodes": []}, {"module": "keras.src.ops.core", "class_name": "Cast", "config": {"dtype": "float16"}, "registered_name": "Cast", "name": "cast", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 384, 708], "dtype": "float32", "keras_history": ["input_features", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Masking", "config": {"name": "masking", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "mixed_float16"}, "registered_name": null}, "mask_value": -100.0}, "registered_name": null, "name": "masking", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 384, 708], "dtype": "float32", "keras_history": ["input_features", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.src.ops.numpy", "class_name": "NotEqual", "config": {"name": "not_equal"}, "registered_name": "NotEqual", "name": "not_equal", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 384, 708], "dtype": "float16", "keras_history": ["cast", 0, 0]}}, -100.0], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "stem_dense", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "mixed_float16"}, "registered_name": null}, "units": 256, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 384, 708]}, "name": "stem_dense", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 384, 708], "dtype": "float16", "keras_history": ["masking", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.src.ops.numpy", "class_name": "Any", "config": {"axis": -1, "keepdims": false}, "registered_name": "Any", "name": "any", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 384, 708], "dtype": "bool", "keras_history": ["not_equal", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "stem_bn", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "mixed_float16"}, "registered_name": null}, "axis": -1, "momentum": 0.95, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "registered_name": null, "build_config": {"input_shape": [null, 384, 256]}, "name": "stem_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 384, 256], "dtype": "float16", "keras_history": ["stem_dense", 0, 0]}}], "kwargs": {"mask": {"class_name": "__keras_tensor__", "config": {"shape": [null, 384], "dtype": "bool", "keras_history": ["any", 0, 0]}}}}]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "stem_act", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "mixed_float16"}, "registered_name": null}, "activation": "silu"}, "registered_name": null, "name": "stem_act", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 384, 256], "dtype": "float16", "keras_history": ["stem_bn", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "SpatialDropout1D", "config": {"rate": 0.1, "seed": null, "name": "stem_drop", "dtype": "float32"}, "registered_name": null, "name": "stem_drop", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 384, 256], "dtype": "float16", "keras_history": ["stem_act", 0, 0]}}], "kwargs": {"training": false}}]}, {"module": null, "class_name": "AttentionMaskFromInput", "config": {"name": "attn_mask", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "mixed_float16"}, "registered_name": null}, "pad_value": -100.0}, "registered_name": "AttentionMaskFromInput", "build_config": {"input_shape": [null, 384, 708]}, "name": "attn_mask", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 384, 708], "dtype": "float32", "keras_history": ["input_features", 0, 0]}}], "kwargs": {}}]}, {"module": null, "class_name": "ConformerBlock", "config": {"name": "conformer_0", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "mixed_float16"}, "registered_name": null}, "dim": 256}, "registered_name": "ConformerBlock", "build_config": {"input_shape": [null, 384, 256]}, "name": "conformer_0", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 384, 256], "dtype": "float16", "keras_history": ["stem_drop", 0, 0]}}], "kwargs": {"attention_mask": {"class_name": "__keras_tensor__", "config": {"shape": [null, 1, 384], "dtype": "bool", "keras_history": ["attn_mask", 0, 0]}}}}]}, {"module": null, "class_name": "ConformerBlock", "config": {"name": "conformer_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "mixed_float16"}, "registered_name": null}, "dim": 256}, "registered_name": "ConformerBlock", "build_config": {"input_shape": [null, 384, 256]}, "name": "conformer_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 384, 256], "dtype": "float16", "keras_history": ["conformer_0", 0, 0]}}], "kwargs": {"attention_mask": {"class_name": "__keras_tensor__", "config": {"shape": [null, 1, 384], "dtype": "bool", "keras_history": ["attn_mask", 0, 0]}}}}]}, {"module": null, "class_name": "ConformerBlock", "config": {"name": "conformer_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "mixed_float16"}, "registered_name": null}, "dim": 256}, "registered_name": "ConformerBlock", "build_config": {"input_shape": [null, 384, 256]}, "name": "conformer_2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 384, 256], "dtype": "float16", "keras_history": ["conformer_1", 0, 0]}}], "kwargs": {"attention_mask": {"class_name": "__keras_tensor__", "config": {"shape": [null, 1, 384], "dtype": "bool", "keras_history": ["attn_mask", 0, 0]}}}}]}, {"module": null, "class_name": "ConformerBlock", "config": {"name": "conformer_3", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "mixed_float16"}, "registered_name": null}, "dim": 256}, "registered_name": "ConformerBlock", "build_config": {"input_shape": [null, 384, 256]}, "name": "conformer_3", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 384, 256], "dtype": "float16", "keras_history": ["conformer_2", 0, 0]}}], "kwargs": {"attention_mask": {"class_name": "__keras_tensor__", "config": {"shape": [null, 1, 384], "dtype": "bool", "keras_history": ["attn_mask", 0, 0]}}}}]}, {"module": null, "class_name": "ConformerBlock", "config": {"name": "conformer_4", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "mixed_float16"}, "registered_name": null}, "dim": 256}, "registered_name": "ConformerBlock", "build_config": {"input_shape": [null, 384, 256]}, "name": "conformer_4", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 384, 256], "dtype": "float16", "keras_history": ["conformer_3", 0, 0]}}], "kwargs": {"attention_mask": {"class_name": "__keras_tensor__", "config": {"shape": [null, 1, 384], "dtype": "bool", "keras_history": ["attn_mask", 0, 0]}}}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "attn_proj", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "mixed_float16"}, "registered_name": null}, "units": 64, "activation": "tanh", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 384, 256]}, "name": "attn_proj", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 384, 256], "dtype": "float16", "keras_history": ["conformer_4", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "attn_score", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "mixed_float16"}, "registered_name": null}, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 384, 64]}, "name": "attn_score", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 384, 64], "dtype": "float16", "keras_history": ["attn_proj", 0, 0]}}], "kwargs": {}}]}, {"module": null, "class_name": "Squeeze", "config": {"name": "attn_squeeze", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "mixed_float16"}, "registered_name": null}, "axis": -1}, "registered_name": "Squeeze", "build_config": {"input_shape": [null, 384, 1]}, "name": "attn_squeeze", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 384, 1], "dtype": "float16", "keras_history": ["attn_score", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Softmax", "config": {"name": "attn_softmax", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "mixed_float16"}, "registered_name": null}, "axis": 1}, "registered_name": null, "name": "attn_softmax", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 384], "dtype": "float16", "keras_history": ["attn_squeeze", 0, 0]}}], "kwargs": {"mask": {"class_name": "__keras_tensor__", "config": {"shape": [null, 384], "dtype": "bool", "keras_history": ["any", 0, 0]}}}}]}, {"module": null, "class_name": "ExpandDims", "config": {"name": "attn_expand", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "mixed_float16"}, "registered_name": null}, "axis": -1}, "registered_name": "ExpandDims", "build_config": {"input_shape": [null, 384]}, "name": "attn_expand", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 384], "dtype": "float16", "keras_history": ["attn_softmax", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Multiply", "config": {"name": "attn_apply", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "mixed_float16"}, "registered_name": null}}, "registered_name": null, "build_config": {"input_shape": [[null, 384, 256], [null, 384, 1]]}, "name": "attn_apply", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 384, 256], "dtype": "float16", "keras_history": ["conformer_4", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 384, 1], "dtype": "float16", "keras_history": ["attn_expand", 0, 0]}}]], "kwargs": {}}]}, {"module": null, "class_name": "ReduceSum", "config": {"name": "attn_pool", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "mixed_float16"}, "registered_name": null}, "axis": 1}, "registered_name": "ReduceSum", "build_config": {"input_shape": [null, 384, 256]}, "name": "attn_pool", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 384, 256], "dtype": "float16", "keras_history": ["attn_apply", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "GlobalAveragePooling1D", "config": {"name": "gap", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "mixed_float16"}, "registered_name": null}, "data_format": "channels_last", "keepdims": false}, "registered_name": null, "name": "gap", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 384, 256], "dtype": "float16", "keras_history": ["conformer_4", 0, 0]}}], "kwargs": {"mask": {"class_name": "__keras_tensor__", "config": {"shape": [null, 384], "dtype": "bool", "keras_history": ["any", 0, 0]}}}}]}, {"module": null, "class_name": "MaskableGlobalMaxPool1D", "config": {"name": "gmp", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "mixed_float16"}, "registered_name": null}, "data_format": "channels_last", "keepdims": false}, "registered_name": "MaskableGlobalMaxPool1D", "name": "gmp", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 384, 256], "dtype": "float16", "keras_history": ["conformer_4", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Concatenate", "config": {"name": "pool_concat", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "mixed_float16"}, "registered_name": null}, "axis": -1}, "registered_name": null, "build_config": {"input_shape": [[null, 256], [null, 256], [null, 256]]}, "name": "pool_concat", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 256], "dtype": "float16", "keras_history": ["attn_pool", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 256], "dtype": "float16", "keras_history": ["gap", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 256], "dtype": "float16", "keras_history": ["gmp", 0, 0]}}]], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "pool_proj", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "mixed_float16"}, "registered_name": null}, "units": 256, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 768]}, "name": "pool_proj", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 768], "dtype": "float16", "keras_history": ["pool_concat", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "pool_ln", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "mixed_float16"}, "registered_name": null}, "axis": [-1], "epsilon": 1e-06, "center": true, "scale": true, "rms_scaling": false, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 256]}, "name": "pool_ln", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 256], "dtype": "float16", "keras_history": ["pool_proj", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.src.ops.numpy", "class_name": "LogicalOr", "config": {"name": "logical_or"}, "registered_name": "LogicalOr", "name": "logical_or", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 384], "dtype": "bool", "keras_history": ["any", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 384], "dtype": "bool", "keras_history": ["any", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.src.ops.numpy", "class_name": "OnesLike", "config": {"name": "ones_like"}, "registered_name": "OnesLike", "name": "ones_like", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 256], "dtype": "float16", "keras_history": ["gap", 0, 0]}}], "kwargs": {"dtype": "bool"}}]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "pool_act", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "mixed_float16"}, "registered_name": null}, "activation": "silu"}, "registered_name": null, "name": "pool_act", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 256], "dtype": "float16", "keras_history": ["pool_ln", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.src.ops.numpy", "class_name": "Concatenate", "config": {"axis": -1}, "registered_name": "Concatenate", "name": "concatenate", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 384], "dtype": "bool", "keras_history": ["logical_or", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 256], "dtype": "bool", "keras_history": ["ones_like", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 384], "dtype": "bool", "keras_history": ["any", 0, 0]}}]], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "head_dense", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "mixed_float16"}, "registered_name": null}, "units": 256, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 256]}, "name": "head_dense", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 256], "dtype": "float16", "keras_history": ["pool_act", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.src.ops.numpy", "class_name": "Any", "config": {"axis": -1, "keepdims": false}, "registered_name": "Any", "name": "any_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1024], "dtype": "bool", "keras_history": ["concatenate", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "head_bn", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "mixed_float16"}, "registered_name": null}, "axis": -1, "momentum": 0.95, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "registered_name": null, "build_config": {"input_shape": [null, 256]}, "name": "head_bn", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 256], "dtype": "float16", "keras_history": ["head_dense", 0, 0]}}], "kwargs": {"mask": {"class_name": "__keras_tensor__", "config": {"shape": [null], "dtype": "bool", "keras_history": ["any_1", 0, 0]}}}}]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "head_drop", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "mixed_float16"}, "registered_name": null}, "rate": 0.2, "seed": null, "noise_shape": null}, "registered_name": null, "name": "head_drop", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 256], "dtype": "float16", "keras_history": ["head_bn", 0, 0]}}], "kwargs": {"training": false}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "classifier", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 250, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 256]}, "name": "classifier", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 256], "dtype": "float16", "keras_history": ["head_drop", 0, 0]}}], "kwargs": {}}]}], "input_layers": [["input_features", 0, 0]], "output_layers": [["classifier", 0, 0]]}, "registered_name": "Functional", "build_config": {"input_shape": null}, "compile_config": {}}